Tekla Open API Reference for Tekla Structures 2025
StructuresDialogAttribute.AttributeType Property
 Gets the attribute type of the property.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Type AttributeType { get; }
Public ReadOnly Property AttributeType As Type
	Get
Property Value
Type: Type
See Also
Reference
StructuresDialogAttribute Class
Tekla.Structures.Dialog Namespace